; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 3018)
	(= (fuel plane1) 908)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city0)
	(= (capacity plane2) 11882)
	(= (fuel plane2) 4725)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city0)
	(= (capacity plane3) 9036)
	(= (fuel plane3) 3363)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at plane4 city1)
	(= (capacity plane4) 4385)
	(= (fuel plane4) 1476)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 7)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 5)
	(at person1 city1)
	(at person2 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 734)
	(= (distance city0 city2) 742)
	(= (distance city0 city3) 702)
	(= (distance city1 city0) 734)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 853)
	(= (distance city1 city3) 973)
	(= (distance city2 city0) 742)
	(= (distance city2 city1) 853)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 568)
	(= (distance city3 city0) 702)
	(= (distance city3 city1) 973)
	(= (distance city3 city2) 568)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city2)
	))

(:metric minimize (+ (* 5 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (fly plane3 city0 city1)
   deleted: (at plane3 city0)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 0 to 2936, (fuel plane3) from 3363 to 427
   goals met: 1 of 2
2. (board person1 plane4 city1)
   deleted: (at person1 city1)
   added: (in person1 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 2
3. (refuel plane4 city1)
   changed: (fuel plane4) from 1476 to 4385
   goals met: 1 of 2
4. (fly plane4 city1 city2)
   deleted: (at plane4 city1)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 2936 to 4642, (fuel plane4) from 4385 to 2679
   goals met: 1 of 2
5. (debark person1 plane4 city2)
   deleted: (in person1 plane4)
   added: (at person1 city2)
   changed: (onboard plane4) from 1 to 0
   goals met: 2 of 2
